joe-eldridge/stm32_cpp_environment_monitor/Core/Src/app.cpp
#include "app.h"

#include <array>
#include <cstdint>
#include <cstring>
#include <optional>

#include "bme280.hpp"
#include "button.hpp"
#include "build_config.hpp"
#include "delay.hpp"
#include "ds3231.hpp"
#include "epaper_display.hpp"
#include "fat_time.hpp"
#include "fatfs.h"
#include "i2c_bus.hpp"
#include "hal_gpio_pin.hpp"
#include "hourly_history.hpp"
#include "i2c_fault_injection.hpp"
#include "main_screen.hpp"
#include "menu.hpp"
#include "menu_screen.hpp"
#include "low_power.hpp"
#include "main.h"
#include "mono_framebuffer.hpp"
#include "rotary_encoder.hpp"
#include "sdcard_diskio.h"
#include "spi_bus.hpp"
#include "stm32l0xx_ll_exti.h"
#include "text_format.hpp"
#include "time_sync.hpp"
#include "trend_screen.hpp"
#include "veml7700.hpp"

extern "C" UART_HandleTypeDef huart2;
extern "C" void SystemClock_Config(void);

namespace
{
// Blinks LD2 forever. Used only for a hardware/bus-level fault (RTC didn't
// even ack its own init write) - not recoverable via a UART prompt, unlike
// an untrustworthy-but-otherwise-working RTC.
[[noreturn]] void HaltWithError()
{
  while (true)
  {
    HAL_GPIO_TogglePin(LD2_GPIO_Port, LD2_Pin);
    HAL_Delay(100);
  }
}

// TEMPORARY: 1 minute instead of the real 5, purely so a Stop-mode wake
// cycle can be observed in about a minute during testing rather than five.
constexpr std::uint8_t kWakeIntervalMinutes = 1;
static_assert(Ds3231::IsValidWakeInterval(kWakeIntervalMinutes), "wake interval must divide 60 evenly");

// A full refresh clears the ghosting partial refreshes leave behind. With a
// 1-minute wake interval this is once an hour.
constexpr std::uint32_t kSamplesPerFullRefresh = 60;

// Samples are averaged over this period, and the 24 most recent periods are
// plotted on the trend screen - so an hour each, covering a day. Shorten it
// (to 1, say) to watch the plot fill during testing; the trend screen then
// replaces the main screen on nearly every wake.
constexpr std::uint16_t kTrendPeriodMinutes = 60;

// Which metric the trend screen plots. The planned encoder menu will make
// this switchable at runtime.
constexpr Metric kTrendMetric = Metric::Temperature;

// A day of averages, about 700 bytes - static rather than on the 1 KB stack.
HourlyHistory g_history(kTrendPeriodMinutes);

// Quadrature steps per detent of the encoder: four transitions, as the part
// is built. Its datasheet is no help, quoting both 20 pulses and 30
// positions per revolution, so this was settled on the bench. Two appeared
// right while the encoder was polled, because a 2ms poll misses about half
// the transitions; decoding in the interrupt sees all four.
constexpr std::uint8_t kEncoderStepsPerDetent = 4;

// How often the switch is sampled while the menu is open. The knob is not
// polled at all - it is decoded in its interrupt - but a button is a level
// to debounce rather than edges to catch, and polling it needs no interrupt
// of its own.
constexpr std::uint32_t kMenuPollMs = 2;

// The menu closes itself if it is left untouched, so a knocked knob can't
// hold the device awake and flatten the battery.
constexpr std::uint32_t kMenuIdleTimeoutMs = 30000;


// Menu messages are shown until dismissed, so one that isn't a literal needs
// somewhere to live that outlives the request that built it.
char g_menuMessage[20] = "";

// Set from the encoder switch's interrupt. Its only job is to wake the MCU
// from Stop mode and say why it woke.
volatile bool g_menuRequested = false;

// The encoder is decoded in the interrupt rather than polled. A display
// refresh blocks the main loop for the best part of a second, and a knob
// turned during one used to be lost entirely; the interrupt catches every
// edge whatever the loop is doing.
RotaryEncoder g_encoder(kEncoderStepsPerDetent);
volatile std::int32_t g_detents = 0;

// Takes what the encoder has decoded since the last call. Interrupts are held
// off for the read and clear together, so a detent arriving in between can't
// be dropped.
int TakeDetents()
{
  // Saved and restored rather than simply re-enabled: this must not turn
  // interrupts on for a caller that had deliberately turned them off.
  const std::uint32_t primask = __get_PRIMASK();
  __disable_irq();
  const int detents = static_cast<int>(g_detents);
  g_detents = 0;
  __set_PRIMASK(primask);
  return detents;
}

// The encoder's interrupts are on only while the menu is open. Left enabled,
// a knocked knob would wake the MCU out of Stop mode and cost a wake cycle
// for nothing.
void SetEncoderInterrupts(bool enabled)
{
  if (enabled)
  {
    __HAL_GPIO_EXTI_CLEAR_IT(ENC_CLK_Pin | ENC_DT_Pin); // whatever happened while off isn't news
    LL_EXTI_EnableIT_0_31(LL_EXTI_LINE_1 | LL_EXTI_LINE_2);
  }
  else
  {
    LL_EXTI_DisableIT_0_31(LL_EXTI_LINE_1 | LL_EXTI_LINE_2);
  }
}

// The display framebuffer and a copy of what the panel is showing: 5 KB
// each, static so they aren't on the 1 KB stack. The second copy is what
// lets an update send only the rows that changed.
std::array<std::uint8_t, Ssd1681::kImageBytes> g_frame{};
std::array<std::uint8_t, Ssd1681::kImageBytes> g_panelImage{};
static_assert(MonoFramebuffer::BufferSize(Ssd1681::kWidth, Ssd1681::kHeight) == Ssd1681::kImageBytes);

// Set once the RTC is up, so FatFs's get_fattime() hook can timestamp files.
// FatFs only calls it from within this thread's f_* calls - never from an ISR.
Ds3231 *g_fatTimeRtc = nullptr;

// Blocking UART output, used for one-off boot messages.
void SendLine(const char *message)
{
  HAL_UART_Transmit(&huart2, reinterpret_cast<const uint8_t *>(message),
                     static_cast<uint16_t>(std::strlen(message)), HAL_MAX_DELAY);
}

void SendDecimal(std::int32_t value)
{
  if (value < 0)
  {
    const uint8_t minus = '-';
    HAL_UART_Transmit(&huart2, &minus, 1, HAL_MAX_DELAY);
    value = -value;
  }

  static const char kDigits[] = "0123456789";
  char digits[10];
  int count = 0;
  do
  {
    digits[count++] = kDigits[value % 10];
    value /= 10;
  } while (value != 0);
  while (count > 0)
  {
    const uint8_t ch = static_cast<uint8_t>(digits[--count]);
    HAL_UART_Transmit(&huart2, &ch, 1, HAL_MAX_DELAY);
  }
}

// Per-wake diagnostics. At 9600 baud each character keeps the MCU awake for
// about 1 ms, and a wake prints around 70 of them, so Release builds drop
// these. Boot-time messages use SendLine() directly and always print.
void WakeLog(const char *message)
{
  if (kDebugBuild)
  {
    SendLine(message);
  }
}

