joe-eldridge/stm32_cpp_environment_monitor/Core/Src/app.cpp
void WakeLogDecimal(std::int32_t value)
{
  if (kDebugBuild)
  {
    SendDecimal(value);
  }
}

constexpr const char *kLogFileName = "LOG.CSV";
constexpr const char *kLogHeader =
    "Timestamp,TemperatureCentiC,PressureCentiHpa,HumidityCentiPct,LuxCenti,LuxSaturated\n";

// Appends one CSV row for this sample: an RTC timestamp plus whichever
// sensor readings succeeded (blank field if a sensor read failed). Logging
// failures (SD not mounted, write error) are reported in the wake log but not
// fatal - sensor sampling and the sleep/wake cycle continue regardless,
// since a lost log entry shouldn't stop the device monitoring.
bool LogRecord(const std::optional<Ds3231::DateTime> &dt, const std::optional<Bme280::Measurements> &measurements,
               const std::optional<Veml7700::Reading> &light)
{
  if (!dt)
  {
    WakeLog(" LogSkipped(rtc)");
    return false;
  }

  FIL file;
  FRESULT result = f_open(&file, kLogFileName, FA_WRITE | FA_OPEN_APPEND);
  if (result == FR_DISK_ERR)
  {
    // With no card-detect input, a swapped card is only noticed when I/O to
    // it fails. That failure marks the card uninitialised, so one retry lets
    // FatFs re-initialise and re-mount it instead of losing this sample.
    // (FR_NOT_READY isn't retried: it means initialisation just failed, e.g.
    // no card inserted, and retrying would only double the time awake.)
    result = f_open(&file, kLogFileName, FA_WRITE | FA_OPEN_APPEND);
  }
  if (result != FR_OK)
  {
    WakeLog(" LogSkipped(open, FRESULT ");
    WakeLogDecimal(result);
    WakeLog(")");
    return false;
  }

  if (f_size(&file) == 0)
  {
    f_printf(&file, kLogHeader);
  }

  f_printf(&file, "%04u-%02u-%02u %02u:%02u:%02u,", dt->year, dt->month, dt->date, dt->hour, dt->minute,
           dt->second);

  if (measurements)
  {
    f_printf(&file, "%d,%d,%d,", measurements->temperatureCenti, measurements->pressureCentiHpa,
             measurements->humidityCentiPct);
  }
  else
  {
    f_printf(&file, ",,,");
  }

  if (light)
  {
    f_printf(&file, "%d,%d\n", light->luxCenti, light->saturated ? 1 : 0);
  }
  else
  {
    f_printf(&file, ",\n");
  }

  // f_close() flushes the buffered row to the card, so this is where a
  // failed write actually shows up.
  result = f_close(&file);
  if (result != FR_OK)
  {
    WakeLog(" LogFailed(close, FRESULT ");
    WakeLogDecimal(result);
    WakeLog(")");
    return false;
  }
  WakeLog(" Logged");
  return true;
}

// Runs the menu to its end: polls the encoder and switch, redraws when
// something changes, and carries out what the menu asks for. Returns when
// the menu closes or is left untouched for kMenuIdleTimeoutMs.
void RunMenu(Ds3231 &rtc, EpaperDisplay &display, const Ssd1681 &panel, InputPin &clk, InputPin &dt, InputPin &sw)
{
  Menu menu;
  const std::optional<Ds3231::DateTime> now = rtc.ReadDateTime();
  if (!now)
  {
    // Without the time there is nothing to seed the clock editor with, and
    // the RTC is the one thing the menu can't work around.
    WakeLog(" MenuSkipped(rtc)");
    return;
  }
  menu.Open(*now);

  // Start from where the knob is sitting, and throw away anything decoded
  // before the menu opened.
  g_encoder.Reset(clk.IsHigh(), dt.IsHigh());
  static_cast<void>(TakeDetents());
  SetEncoderInterrupts(true);

  Button button;
  // The switch that woke the MCU is usually still down: adopt it, or its
  // release would open the menu and immediately act on it.
  button.Reset(!sw.IsHigh(), HAL_GetTick());

  bool firstDraw = true;
  const auto drawMenu = [&display, &panel, &menu, &firstDraw](const char *what) {
    const MenuView view = menu.View();
    // Partial throughout, the opening screen included: a full refresh takes
    // 2.1s against 0.6s, and opening the menu is when someone is waiting on
    // it most. Ghosting of the main screen behind the menu would be cleared
    // by the full refresh on the way out; in practice there is none. (If the
    // panel's contents aren't known, EpaperDisplay upgrades this to full by
    // itself.)
    const Ssd1681::RefreshMode mode = Ssd1681::RefreshMode::Partial;
    const std::uint32_t startedMs = HAL_GetTick();
    std::uint32_t drawMs = 0;
    const bool updated = display.Update(mode, [&view, &drawMs](MonoFramebuffer &c) {
      const std::uint32_t drawStartedMs = HAL_GetTick();
      DrawMenuScreen(c, view);
      drawMs = HAL_GetTick() - drawStartedMs;
    });
    // "Shown" is what the user waits for: from the input being handled to
    // the new image being on the panel. "Done" adds whatever is sent after
    // that, which delays nothing visible.
    const std::uint32_t doneMs = HAL_GetTick() - startedMs;
    const std::uint32_t shownMs = panel.LastRefreshMs() != 0 ? panel.LastRefreshEndedAt() - startedMs : doneMs;
    // Where "shown" goes: drawing into the framebuffer, waking the panel, the
    // panel's own waveform, and the rest - comparing images and sending rows.
    const std::uint32_t accountedMs = drawMs + panel.LastWakeMs() + panel.LastRefreshMs();
    WakeLog(firstDraw ? "\r\nMenu open: shown " : "\r\nMenu step: shown ");
    WakeLogDecimal(static_cast<std::int32_t>(shownMs));
    WakeLog("ms = draw ");
    WakeLogDecimal(static_cast<std::int32_t>(drawMs));
    WakeLog(" + wake ");
    WakeLogDecimal(static_cast<std::int32_t>(panel.LastWakeMs()));
    WakeLog(" + panel ");
    WakeLogDecimal(static_cast<std::int32_t>(panel.LastRefreshMs()));
    WakeLog(" + rest ");
    WakeLogDecimal(static_cast<std::int32_t>(shownMs > accountedMs ? shownMs - accountedMs : 0));
    WakeLog(", done ");
    WakeLogDecimal(static_cast<std::int32_t>(doneMs));
    WakeLog(updated ? "ms" : "ms FAILED");
    WakeLog(what);
    firstDraw = false;
  };

  // Redraws happen as soon as there is something to show. Turns made while
  // a refresh is running aren't lost - the encoder is decoded in its
  // interrupt - so they are all folded into the next redraw: the first click
  // gets an immediate response, and a fast spin costs two refreshes rather
  // than one per detent.
  bool redraw = true;
  std::uint32_t lastInputMs = HAL_GetTick();

  while (menu.IsOpen())
  {
    if (redraw)
    {
      drawMenu("");
      redraw = false;
      // Nothing is polled during a refresh, so the switch starts again from
      // where it is now. The knob needs no such treatment: its interrupts
      // kept running throughout, and what it did is waiting to be read.
      button.Reset(!sw.IsHigh(), HAL_GetTick());
      lastInputMs = HAL_GetTick();
    }

    const int detents = TakeDetents();
    const Button::Event event = button.Update(!sw.IsHigh(), HAL_GetTick()); // active low, with a pull-up
    if (detents != 0 || event != Button::Event::None)
    {
      lastInputMs = HAL_GetTick();
      redraw = true;
    }

