joe-eldridge/stm32_cpp_environment_monitor/Core/Src/app.cpp
    const MenuRequest request = menu.Update(detents, event);
    switch (request.action)
    {
    case MenuAction::SetTime:
      menu.Complete(rtc.SetDateTime(request.time) && rtc.ClearOscillatorStopFlag() ? "Clock set" : "Clock NOT set");
      break;

    case MenuAction::EjectCard:
      // Unregister the volume and let go of the card, so what FatFs has
      // buffered is on it before it's pulled.
      static_cast<void>(f_mount(nullptr, USERPath, 0));
      SdCard_Deinit();
      menu.Complete("Safe to remove");
      break;

    case MenuAction::EraseLogs:
    {
      // Deleting the file, not rebuilding the filesystem. Making a new
      // filesystem means writing out the whole FAT, which on a 16GB card at
      // this bus speed takes over ten minutes; unlinking one file takes
      // milliseconds and is what "erase all logs" actually means. A card
      // that needs a real format is a job for a PC.
      const FRESULT result = f_unlink(kLogFileName);
      WakeLog(" erase FRESULT ");
      WakeLogDecimal(static_cast<std::int32_t>(result));
      if (result == FR_OK)
      {
        menu.Complete("Logs erased");
      }
      else if (result == FR_NO_FILE)
      {
        menu.Complete("No logs to erase");
      }
      else
      {
        char code[4] = "";
        static_cast<void>(text_format::Integer(code, sizeof(code), static_cast<std::int32_t>(result)));
        text_format::Copy(g_menuMessage, sizeof(g_menuMessage), "Erase failed ");
        text_format::Append(g_menuMessage, sizeof(g_menuMessage), code);
        menu.Complete(g_menuMessage);
      }
      break;
    }

    case MenuAction::Close:
    case MenuAction::None:
      break;
    }

    if (request.action != MenuAction::None && request.action != MenuAction::Close)
    {
      redraw = true;
      continue; // show the outcome without waiting for the poll interval
    }

    if (HAL_GetTick() - lastInputMs >= kMenuIdleTimeoutMs)
    {
      WakeLog(" MenuTimedOut");
      break;
    }

    DelayMs(kMenuPollMs);
  }

  SetEncoderInterrupts(false);

  // The card is registered again on the way out, whichever way the menu was
  // left, so the next sample logs as usual. This doesn't touch the card, so
  // it works with the card still out.
  static_cast<void>(f_mount(&USERFatFS, USERPath, 0));
}

} // namespace

extern "C" void HAL_GPIO_EXTI_Callback(std::uint16_t GPIO_Pin)
{
  // The RTC alarm on PC0 also lands here; it needs no handling beyond
  // having woken the MCU.
  if (GPIO_Pin == ENC_SW_Pin)
  {
    g_menuRequested = true;
  }
  else if (GPIO_Pin == ENC_CLK_Pin || GPIO_Pin == ENC_DT_Pin)
  {
    // Both lines are read on either line's edge: what the decoder needs is
    // the pair, not which of them moved.
    const bool clk = HAL_GPIO_ReadPin(ENC_CLK_GPIO_Port, ENC_CLK_Pin) == GPIO_PIN_SET;
    const bool dt = HAL_GPIO_ReadPin(ENC_DT_GPIO_Port, ENC_DT_Pin) == GPIO_PIN_SET;
    g_detents += g_encoder.Update(clk, dt);
  }
}

std::uint32_t AppGetFatTime()
{
  if (g_fatTimeRtc == nullptr)
  {
    return 0;
  }
  const std::optional<Ds3231::DateTime> dt = g_fatTimeRtc->ReadDateTime();
  if (!dt)
  {
    return 0;
  }
  return PackFatTime(*dt);
}

void AppMain()
{
  low_power::ConfigureStopMode();

  // Pins as configured by MX_I2C1_Init(): PB8 = SCL, PB9 = SDA.
  const I2cBus::Pin i2c1Scl{GPIOB, LL_GPIO_PIN_8};
  const I2cBus::Pin i2c1Sda{GPIOB, LL_GPIO_PIN_9};
  I2cBus i2c1(I2C1, i2c1Scl, i2c1Sda);

  // A reset can land mid-transaction and leave a sensor holding SDA low.
  // The peripheral can't detect that as "busy" (it never saw the START), so
  // clear it up front rather than letting the first transaction fail.
  const bool sdaStuckAtBoot = !LL_GPIO_IsInputPinSet(i2c1Sda.port, i2c1Sda.pinMask);
  const bool busReleased = i2c1.Recover();
  if (sdaStuckAtBoot)
  {
    SendLine("\r\nI2C: SDA held low at boot - recovery ");
    SendLine(busReleased ? "succeeded" : "FAILED");
  }

  // Test hook for the recovery above: hold B1 while pressing reset. The bus
  // is deliberately wedged mid-read (BME280 chip ID 0x60 starts with a 0
  // bit), then the MCU resets itself, as if a reset had hit a real read.
  // Release B1 before the reset completes, or the cycle repeats.
  if (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_RESET)
  {
    SendLine("\r\nB1 held - wedging I2C bus: ");
    const bool wedged = WedgeI2cBus(I2C1, i2c1Scl, i2c1Sda, Bme280::kI2cAddressSdoHigh, 0xD0);
    SendLine(wedged ? "SDA held low, resetting" : "FAILED to wedge, resetting");
    NVIC_SystemReset();
  }

  I2cBusDevice rtcDevice(i2c1, Ds3231::kI2cAddress7Bit);
  I2cBusDevice bme280Device(i2c1, Bme280::kI2cAddressSdoHigh); // SDO tied to VDD, matching hello_world's wiring
  I2cBusDevice veml7700Device(i2c1, Veml7700::kI2cAddress7Bit);

  Ds3231 rtc(rtcDevice);
  if (!rtc.Init())
  {
    HaltWithError();
  }

  if (!rtc.ClearAlarmFlag())
  {
    // A1F may already be latched from earlier testing/manufacturing -
    // if so, SQW/INT is already held low, and PC0's falling-edge EXTI
    // trigger would never see an edge to wake on. Must start clean.
    HaltWithError();
  }

  if (rtc.IsOscillatorStopped())
  {
    SyncTimeFromUart(&huart2, rtc);
  }

  g_fatTimeRtc = &rtc;

  Bme280 bme280(bme280Device);
  if (!bme280.Init())
  {
    HaltWithError();
  }

  Veml7700 veml7700(veml7700Device);
  if (!veml7700.Init())
  {
    HaltWithError();
  }

  SpiBus einkSpi(SPI1, eInk_CS_GPIO_Port, eInk_CS_Pin);
  HalOutputPin einkDataCommand(eInk_D_C_GPIO_Port, eInk_D_C_Pin);
  HalOutputPin einkReset(eInk_RST_GPIO_Port, eInk_RST_Pin);
  HalInputPin einkBusy(eInk_BUSY_GPIO_Port, eInk_BUSY_Pin);
  Ssd1681 panel(einkSpi, einkDataCommand, einkReset, einkBusy);
  MonoFramebuffer canvas(g_frame.data(), Ssd1681::kWidth, Ssd1681::kHeight);
  EpaperDisplay display(panel, canvas, g_panelImage.data());

  // The SPI bit rate sets how long a 5KB image takes to send, so it is worth
  // knowing exactly rather than inferring it from the clock tree.
  WakeLog("\r\nSPI1 baud rate divider: 1/");
  WakeLogDecimal(static_cast<std::int32_t>(2u << ((SPI1->CR1 >> 3) & 0x7u)));
  WakeLog(", PCLK2 ");
  WakeLogDecimal(static_cast<std::int32_t>(HAL_RCC_GetPCLK2Freq()));
  WakeLog("Hz");

  MX_FATFS_Init();
  const FRESULT mounted = f_mount(&USERFatFS, USERPath, 1);
  const SdCardInitReport initReport = SdCard_GetInitReport();
  SendLine("\r\nSD init took ");
  SendDecimal(static_cast<std::int32_t>(initReport.durationMs));
  SendLine("ms, reached ");
  SendLine(initReport.stage);
  if (mounted != FR_OK)
  {
    // Not fatal: sensor sampling and Stop-mode sleep/wake still work
    // without a card, and each LogRecord() retries the mount, so logging
    // starts by itself once a card is inserted.
    SendLine("\r\nSD mount failed - will retry each wake");
  }

  // CubeMX enables both encoder EXTI lines at init; they stay masked until
  // the menu opens.
  SetEncoderInterrupts(false);

