joe-eldridge/stm32_cpp_environment_monitor/Core/Src/app.cpp
  HalInputPin encoderClk(ENC_CLK_GPIO_Port, ENC_CLK_Pin);
  HalInputPin encoderDt(ENC_DT_GPIO_Port, ENC_DT_Pin);
  HalInputPin encoderSwitch(ENC_SW_GPIO_Port, ENC_SW_Pin);

  // Sample 0 is taken straight after boot, so the screen shows real values
  // from the start; every later sample follows an RTC alarm wake.
  bool wasTrendScreen = false;
  bool leftMenu = false;
  for (std::uint32_t sample = 0;; ++sample)
  {
    WakeLog("\r\nSample #");
    WakeLogDecimal(static_cast<std::int32_t>(sample));
    WakeLog(" ");

    const std::optional<Ds3231::DateTime> now = rtc.ReadDateTime();

    const std::optional<Bme280::Measurements> measurements = bme280.Read();
    if (measurements)
    {
      WakeLog("T=");
      WakeLogDecimal(measurements->temperatureCenti);
      WakeLog(" P=");
      WakeLogDecimal(measurements->pressureCentiHpa);
      WakeLog(" H=");
      WakeLogDecimal(measurements->humidityCentiPct);
    }
    else
    {
      WakeLog("BME280 read failed");
    }

    const std::optional<Veml7700::Reading> light = veml7700.Read();
    if (light)
    {
      WakeLog(" Lux=");
      WakeLogDecimal(light->luxCenti);
      if (light->saturated)
      {
        WakeLog("(saturated)");
      }
    }
    else
    {
      WakeLog(" VEML7700 read failed");
    }

    const bool logged = LogRecord(now, measurements, light);

    // Without a timestamp a sample can't be placed on the time axis, so it
    // is logged (above, if the RTC read succeeded) but not averaged.
    const bool periodEnded = now ? g_history.Add(*now, measurements, light) : false;

    MainScreenData screen;
    screen.time = now;
    screen.climate = measurements;
    screen.light = light;
    screen.storageOk = logged;
    screen.wakeIntervalMinutes = kWakeIntervalMinutes;

    TrendScreenData trend;
    trend.history = &g_history;
    trend.metric = kTrendMetric;
    trend.time = now;

    // The trend screen appears for one wake whenever a period completes,
    // i.e. on the first sample of each hour; the main screen shows the rest
    // of the time. Swapping between two whole screens is worth a full
    // refresh, which also clears any accumulated ghosting.
    // The first update after boot is always full (EpaperDisplay enforces it),
    // clearing whatever the panel showed before. A failure isn't fatal:
    // sampling and logging carry on.
    const bool fullRefresh =
        periodEnded || wasTrendScreen || leftMenu || (sample % kSamplesPerFullRefresh == 0);
    const Ssd1681::RefreshMode mode = fullRefresh ? Ssd1681::RefreshMode::Full : Ssd1681::RefreshMode::Partial;
    const bool updated = periodEnded
                             ? display.Update(mode, [&trend](MonoFramebuffer &c) { DrawTrendScreen(c, trend); })
                             : display.Update(mode, [&screen](MonoFramebuffer &c) { DrawMainScreen(c, screen); });
    if (!updated)
    {
      WakeLog(" DisplayFailed");
    }
    wasTrendScreen = periodEnded;
    leftMenu = false;

    // A press while the device was awake is honoured here rather than being
    // held over until after the next alarm, when it would look like the
    // menu had opened by itself.
    if (g_menuRequested)
    {
      WakeLog("\r\nMenu opened");
      RunMenu(rtc, display, panel, encoderClk, encoderDt, encoderSwitch);
      leftMenu = true;
      // Every press inside the menu re-raises the interrupt, so the flag is
      // cleared on the way out rather than on the way in - otherwise the
      // menu would reopen the moment it was closed.
      g_menuRequested = false;
    }

    if (!rtc.ScheduleNextAlarm(kWakeIntervalMinutes))
    {
      // No alarm armed means nothing will ever wake the device again - halt
      // visibly rather than sleep into a dead end.
      HaltWithError();
    }

    WakeLog("\r\nSleeping...");

    // SysTick (HCLK-derived) has no clock source once the core stops in
    // Stop mode - suspending it first avoids it silently missing ticks
    // that would otherwise throw off HAL_GetTick()-based timeouts on wake.
    HAL_SuspendTick();
    HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);

    // Stop mode always resumes on MSI regardless of what was running
    // before it, and fully powers down HSI16 (needed for I2C1's Fast Mode
    // kernel clock) - both need restoring before anything below can
    // safely touch the RTC over I2C.
    SystemClock_Config();
    HAL_ResumeTick();

    if (!rtc.ClearAlarmFlag())
    {
      // Alarm flag stuck set means SQW/INT stays asserted and this loop
      // would spin through Stop mode with no real sleep ever happening.
      HaltWithError();
    }

    // Woken by the encoder switch rather than the alarm: show the menu, then
    // carry on round the loop, which takes a fresh sample and re-arms the
    // alarm.
    if (g_menuRequested)
    {
      WakeLog("\r\nMenu opened");
      RunMenu(rtc, display, panel, encoderClk, encoderDt, encoderSwitch);
      leftMenu = true;
      // Every press inside the menu re-raises the interrupt, so the flag is
      // cleared on the way out rather than on the way in - otherwise the
      // menu would reopen the moment it was closed.
      g_menuRequested = false;
    }
  }
}
